function [m] = my_A44_to_Z44(a)
% ‘ункци€ кодировани€ исходного сообщени€ с использованием алфавита Z44 
% јлгоритм работы данной функции изложен в разделе 4.1
% ‘ункци€ работает в соответствии с формулой (1) раздела 4.1.
% -------------------------------------------------------------------------
% ¬ходные параметры:
% - a - исходное сообщение
% -------------------------------------------------------------------------
% ¬ыходные параметры:
% - m - закодированное сообщение
% -------------------------------------------------------------------------
    m = zeros(1, length(a));
    alphabet = 'јЅ¬√ƒ≈∆«»… ЋћЌќѕ–—“”‘’÷„ЎўЏџ№Ёёя!?.,:;()""-';
    for i = 1:length(a)
        if a(i) == ' '
            m(i) = 0;
        else
            m(i) = find(alphabet==a(i));
        end 
    end
end