% Исходные данные
p = 251; q = 293;

disp('_____________________________________________________________________')
a = 'КУЗНЕЦОВ НИКИТА АНДРЕЕВИЧ'; % Исходное сообщение
disp(['Исходное сообщение: ', a]);
disp('_____________________________________________________________________')
disp('Исходные данные:');
disp(['p = ', num2str(p)]);
disp(['q = ', num2str(q)]);
disp('_____________________________________________________________________')

% Генерация ключей
disp('Ключи:');
[n, phi, e, d] = my_key_gen(p, q);
disp(['n = pq = ', num2str(n)]);
disp(['phi = (p - 1)(q - 1) = ', num2str(phi)]);
disp(['Закрытый ключ e = ', num2str(e)]);
disp(['Открытый ключ d = ', num2str(d)]);
disp('_____________________________________________________________________')

% Кодирование сообщения
m = my_A44_to_Z44(a);
disp('Закодированное сообщение: ');
disp(m)
disp('_____________________________________________________________________')

% Шифрование сообщения
c = my_shifr_rsa(m, d, n);
disp('Зашифрованное сообщение :')
disp(c);
disp('_____________________________________________________________________')

% Дешифрования сообщения
m_ = my_deshifr_rsa(c, e, n);
disp('Дешифрованное сообщение:');
disp(m_);
disp('_____________________________________________________________________')
% Декодирование сообщения
a_ = my_Z44_to_A44(m_);
disp('Декодированное сообщение: ')
disp(a_);
disp('_____________________________________________________________________')