function [a] = my_Z44_to_A44(m)
% ‘ункци€ декодировани€ исходного сообщени€ с использованием алфавита Z44
% јлгоритм работы функции приведен в разделе 4.11
% ‘ункци€ работает в соответствии с формулой (22) раздела 4.11
% -------------------------------------------------------------------------
% ¬ходные параметры:
%  m - закодированное сообщение
% -------------------------------------------------------------------------
% ¬ыходные параметры:
%  a - декодированное сообщение
% -------------------------------------------------------------------------
    a = blanks(length(m));
    alphabet = 'јЅ¬√ƒ≈∆«»… ЋћЌќѕ–—“”‘’÷„ЎўЏџ№Ёёя!?.,:;()""-';
    for i = 1:length(m)
        if m(i) == 0
            a(i) = ' ';
        else
            a(i) = alphabet(m(i));
        end
    end
end